{
  "title": "A Platform for a Transparent, Just, and Free America - Test",
  "sections": [
    {
      "id": "trust",
      "index": 1,
      "title": "Restoring Trust in Government",
      "items": [
        { "title": "Budget Transparency", "text": "Mandate clear, accessible public reporting of all federal expenditures." },
        { "title": "Accountability in Power", "text": "Public release of the Epstein list to ensure transparency in matters of corruption and abuse." },
        { "title": "Conflict of Interest Reform", "text": "All elected officials and cabinet members must divest from private investments before assuming office." },
        { "title": "End Corruption", "text": "Outlaw lobbying and bribery in Washington; enact real-time disclosure of all political spending and contacts." },
        { "title": "Age Limits for Office", "text": "Impose maximum age limits for both congressional and presidential candidates to ensure generational turnover." },
        { "title": "Supreme Court Ethics", "text": "Enforce binding ethics, financial disclosure, and recusal rules for Supreme Court justices; study options for structural reform and term limits." }
      ]
    },
    {
      "id": "democracy",
      "index": 2,
      "title": "Strengthening Democracy",
      "items": [
        { "title": "Modernized Elections", "text": "Implement ranked-choice voting for congressional and presidential elections nationwide." },
        { "title": "Redistricting Reform", "text": "Require independent redistricting commissions in every state to eliminate partisan gerrymandering." },
        { "title": "Universal Civic Duty", "text": "Mandatory voting in federal elections with small fines for non-participation. Every voter retains the right to submit a blank ballot or select a formal ‘none of the above.’" },
        { "title": "Ban on Encouraging Invalid Votes", "text": "Prohibit organized efforts to promote blank/invalid ballots during elections." },
        { "title": "Voting Accessibility", "text": "Make Election Day a national holiday and require at least 4 hours of paid time off to vote." },
        { "title": "Expanded Electorate", "text": "Lower the voting age to 16." }
      ]
    },
    {
      "id": "rights",
      "index": 3,
      "title": "Protecting Rights & Freedoms",
      "items": [
        { "title": "Codify Core Rights", "text": "Enshrine Roe v. Wade, Obergefell v. Hodges, Loving v. Virginia, and Griswold v. Connecticut in federal law." },
        { "title": "Free Expression", "text": "Protect speech and assembly on college campuses, including political and anti-war protest." },
        { "title": "Live-and-Let-Live", "text": "Safeguard personal freedoms from undue government intrusion." },
        { "title": "Secular Governance", "text": "Strengthen the separation of church and state: prohibit religious tests for office, bar use of public funds for religious indoctrination, keep government policy and public education neutral on religion, and remove official religious endorsements or symbols from government institutions." }
      ]
    },
    {
      "id": "welfare",
      "index": 4,
      "title": "Health, Safety, and Social Welfare",
      "items": [
        { "title": "Universal Healthcare (State-Run Single Payer)", "text": "Replace Medicaid/Medicare with interoperable, state-administered single-payer systems guaranteeing comprehensive coverage in every state, including rural access." },
        { "title": "Prescription Drug Reform", "text": "Tie prices to a global reference basket; significantly shorten patent exclusivity; allow emergency suspension of patents for high-impact public health drugs (e.g., GLP-1s) to ensure access." },
        { "title": "Mental Health Parity", "text": "Enforce equal coverage and access across all plans and networks." },
        { "title": "Reproductive Healthcare", "text": "Fully fund Planned Parenthood and community clinics." },
        { "title": "School Safety", "text": "Federally fund evidence-based security upgrades at schools." },
        { "title": "Social Supports", "text": "Relax SSI/SSDI eligibility; remove SNAP work requirements; raise SNAP income limits." }
      ]
    },
    {
      "id": "labor",
      "index": 5,
      "title": "Economic Justice & Labor Rights",
      "items": [
        { "title": "Fair Wages", "text": "Raise the federal minimum wage to $25/hr." },
        { "title": "Automatic Cost-of-Living Adjustments", "text": "Index the minimum wage to inflation with scheduled annual adjustments." },
        { "title": "Collective Bargaining", "text": "Protect the right to unionize; ban captive-audience meetings and union-busting tactics; require good-faith bargaining." },
        { "title": "Gig Worker Protections", "text": "End misclassification; if treated as contractors, require core benefits via platform-funded benefits pools." },
        { "title": "Overtime & Misclassification", "text": "Strengthen overtime rules and penalties for wage theft; tighten exemptions." },
        { "title": "Corporate Responsibility", "text": "Increase corporate tax rates and aggressively enforce antitrust laws to break up monopolies." }
      ]
    },
    {
      "id": "tax",
      "index": 6,
      "title": "Taxation & Wealth",
      "items": [
        { "title": "Wealth Tax", "text": "Levy a modest annual tax on extreme wealth (e.g., above a high threshold)." },
        { "title": "Capital Gains Parity (Under Review)", "text": "Study phased parity of capital gains and ordinary income, with safeguards for retirement savings and small business investment." },
        { "title": "Estate Tax Reform", "text": "Exempt estates under $5 million (indexed to inflation) to support generational wealth-building; impose progressive rates above that, with significantly higher rates on ultra-high-value estates." }
      ]
    },
    {
      "id": "housing",
      "index": 7,
      "title": "Housing & Community Stability",
      "items": [
        { "title": "Vacancy Penalties", "text": "Impose substantial fines on properties left vacant longer than 6 months without residents." },
        { "title": "Anti-Corporate Rentals", "text": "Prohibit hedge funds and real estate conglomerates from buying/renting single-family homes; restrict SFR ownership to individuals." },
        { "title": "Community Priority", "text": "Treat housing as a right and curb speculative practices that reduce supply." }
      ]
    },
    {
      "id": "justice",
      "index": 8,
      "title": "Criminal Justice Reform",
      "items": [
        { "title": "Gun Safety with Amnesty", "text": "Nationwide voluntary gun buyback with full amnesty for surrendering illegal firearms; universal background checks for all purchases." },
        { "title": "Drug Policy", "text": "Decriminalize low-level possession; expand treatment-first approaches." },
        { "title": "Bail Reform", "text": "Eliminate cash bail for non-violent offenses; implement equitable ability-to-pay standards so bail is proportional and does not criminalize poverty." },
        { "title": "Police Accountability", "text": "National use-of-force standards, universal body cams, independent state oversight boards with enforcement power; end qualified immunity; reform police union practices that obstruct accountability." },
        { "title": "Prison Reform", "text": "End for-profit prisons; improve conditions; expand education and reentry; automatic expungement for cannabis and other decriminalized offenses; federally legalize/reschedule cannabis." }
      ]
    },
    {
      "id": "infra",
      "index": 9,
      "title": "Environment, Infrastructure & Technology",
      "items": [
        { "title": "Green Renewal 2.0", "text": "Relaunch a climate/jobs program with deeper investment in renewables, grid-scale storage, and decarbonized industry." },
        { "title": "Grid & Energy Security", "text": "Modernize and harden the national grid; deepen partnerships with allied nations (e.g., Korea) to accelerate advanced transmission, batteries, and clean manufacturing." },
        { "title": "Water Systems", "text": "National program to replace lead pipes, secure reservoirs, and drought-proof critical regions." },
        { "title": "Interstate Upgrades", "text": "Rebuild and thicken interstate roadbeds (Autobahn-style longevity) to reduce life-cycle costs; prioritize safety and freight efficiency." },
        { "title": "Earthquake Resilience", "text": "Adopt Japan-style seismic standards and retrofit programs in quake-prone regions." },
        { "title": "High-Speed Rail & Transit", "text": "Fund national HSR corridors and clean mass transit—ambitious but essential for mobility, climate, and competitiveness." },
        { "title": "Digital Commons", "text": "Classify broadband as a basic utility/common carrier; codify net neutrality; GDPR-style data privacy; Right to Repair across devices and equipment." },
        { "title": "AI Oversight", "text": "Federal AI safety/ethics regulator; risk-tiered audits; transparency for high-impact systems." }
      ]
    },
    {
      "id": "education",
      "index": 10,
      "title": "Education & Childcare",
      "items": [
        { "title": "Universal Pre-K", "text": "Free, universal early childhood education." },
        { "title": "Free Childcare for Struggling Families", "text": "Means-tested support to ensure parents can work or study." },
        { "title": "K–12 Funding Reform", "text": "Keep property taxes, but pool them statewide and distribute by student population and need—ending district wealth gaps." },
        { "title": "Tuition-Free College", "text": "Public colleges and trade schools tuition-free; robust apprenticeships and vocational pathways." }
      ]
    },
    {
      "id": "rural",
      "index": 11,
      "title": "Rural & Regional Equity",
      "items": [
        { "title": "Healthcare Access", "text": "Guaranteed via universal single-payer coverage, mobile clinics, and rural hospital sustainment." },
        { "title": "Support Small Farmers", "text": "Shift subsidies and market power away from agribusiness monopolies; invest in local and sustainable agriculture." },
        { "title": "Trampoline Effect for Sustainable Farming", "text": "Invest in resilience so farms bounce back stronger from shocks: climate-smart practices (soil carbon, cover crops, water capture), diversified farm income (local processing, value-add, agritourism), on-farm renewables and microgrids, methane capture/composting, drought/flood adaptation, and rapid-response grants or reinsurance—building green supply chains and rural jobs." },
        { "title": "Disaster Preparedness", "text": "Scale wildfire, quake (Cascadia), flood, and hurricane readiness with resilient infrastructure and community response funding." }
      ]
    },
    {
      "id": "foreign",
      "index": 12,
      "title": "Foreign Policy & Defense",
      "items": [
        { "title": "End Endless Wars", "text": "Reassert congressional war powers; restrict unauthorized overseas interventions." },
        { "title": "Allies & Values", "text": "Maintain robust support for Ukraine’s defense; end U.S. funding for Israel’s military operations; pursue human-rights-centered diplomacy." },
        { "title": "Defense Audit & Transparency", "text": "Comprehensive audits and waste reduction with redactions narrowly tailored to protect operatives, sources, and sensitive capabilities." }
      ]
    },
    {
      "id": "immigration",
      "index": 13,
      "title": "Immigration & Citizenship",
      "items": [
        { "title": "Earned Path to Citizenship", "text": "Create a clear, humane path to citizenship for undocumented residents, including Dreamers—background checks, English/civics, and reasonable fees with access to legal counsel." },
        { "title": "Modernized Legal Immigration", "text": "Digitize case management, expand and right-size visa numbers, clear backlogs, and create regional processing hubs for timely, fair adjudication." },
        { "title": "Humane Border & Smart Enforcement", "text": "Shift from mass detention to case management; significantly reduce ICE workforce; end family separation; prioritize enforcement against trafficking, violent crime, and abusive employers." },
        { "title": "Work Authorization & Worker Protections", "text": "Provide timely work permits and protect workers—regardless of status—from exploitation; decouple status from a single employer to reduce coercion." },
        { "title": "Integration", "text": "Invest in English language learning, credential recognition, and job training so newcomers contribute fully and safely." }
      ]
    }
  ]
}
